erikjuvan/stm32_cmake_examples/ex1_wm_pu_safe/src/STL/X_CUBE_CLASSB_V2_3_0/src/stm32xx_STLstartup.c
/**
  ******************************************************************************
  * @file    stm32xx_STLstartup.c 
  * @author  MCD Application Team
  * @version V2.3.0
  * @date    28-Jun-2019
  * @brief   This file contains sequence of self-test routines to be executed just
  *          after initialization of the application before main execution starts
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32xx_STLparam.h"
#define ALLOC_GLOBALS
#include "stm32xx_STLlib.h"

/** @addtogroup STM32xxSelfTestLib_src
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  IWDG_HandleTypeDef IwdgHandle = {0};
  WWDG_HandleTypeDef WwdgHandle = {0};
  CRC_HandleTypeDef CrcHandle;

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* Private functions ---------------------------------------------------------*/
#ifdef __GNUC__
   extern void Startup_Copy_Handler (void);
   extern void __libc_init_array (void);
#endif /* GCC Compiler */
   
/******************************************************************************/
/**
  * @brief  This routine is executed in case of failure is detected by one of
  *    self-test routines. The routine is empty and it has to be filled by end
  *    user to keep application safe while define proper recovery operation
  * @param  : None
  * @retval : None
  */
void FailSafePOR(void)
{
  /* disable any checking services at SystTick interrupt */
  TickCounter = TickCounterInv = 0u;
  
  /* Code change: workaround for errata issue 2.2.1 */
  /* ERRATA
  https://www.st.com/resource/en/errata_sheet/es0548-stm32g0b1xbxcxe-device-errata-stmicroelectronics.pdf
  2.2 System -> 2.2.1 Unstable LSI when it clocks RTC or CSS on LSE
  Workaround: Disabling RTC Clock and performing System reset seems to help stabilize LSI Clock */
  LL_RCC_DisableRTC();

  #ifdef STL_VERBOSE_POR
    SystemCoreClockUpdate();
    USART_Reconfiguration();
    printf(" >>>>>>>>>> FailSafe Mode <<<<<<<<<<\n\r");
  #endif  /* STL_VERBOSE_POR */
  
  /* Code change START
   * Signal to USER app that critical error happend and class B will reset.
   * Also give USER app time to save current state to FLASH to allow it to continue after reset.
   */
  #ifdef USE_INDEPENDENT_WDOG
    IwdgHandle.Instance = IWDG;
    HAL_IWDG_Refresh(&IwdgHandle);
  #endif /* USE_INDEPENDENT_WDOG */
  #ifdef USE_WINDOW_WDOG
    WwdgHandle.Instance = WWDG;
    HAL_WWDG_Refresh(&WwdgHandle);
  #endif /* USE_WINDOW_WDOG */
  error_handler(eSAFE_ERROR_RESET);
  /* Code change END */

  #if defined STL_EVAL_MODE
    /* LED_ERR On for debug purposes */
    BSP_LED_On(LED_ERR);
    #if defined STL_EVAL_LCD
      if(Is_LCD_Initialized == 1)
      {
        BSP_LCD_DisplayStringAtLine(6, (uint8_t *)(">>> Fail Safe Mode <<<"));
      }
    #endif /* STL_EVAL_LCD */
  #endif  /* STL_EVAL_MODE */
      
  while(1)
  {
    #ifndef NO_RESET_AT_FAIL_MODE
      /* Generate system reset */
      HAL_NVIC_SystemReset();
    #else
      while(1)
      {
    #ifdef USE_INDEPENDENT_WDOG
    	  IwdgHandle.Instance = IWDG;
    	  HAL_IWDG_Refresh(&IwdgHandle);
    #endif /* USE_INDEPENDENT_WDOG */
        #ifdef USE_WINDOW_WDOG
          WwdgHandle.Instance = WWDG;
          HAL_WWDG_Refresh(&WwdgHandle);
        #endif /* USE_WINDOW_WDOG */
      }
    #endif /* NO_RESET_AT_FAIL_MODE */
  }
}

#ifdef __CC_ARM             /* KEIL Compiler */
/******************************************************************************/
/**
  * @brief  Switch between startup and main code
  * @param  : None
  * @retval : None
  */
  void $Sub$$main(void)
  {
    if ( CRC_FLAG != 0xAAu )
    {
      STL_StartUp();		/* trick to call StartUp before main entry */
    }
    CRC_FLAG = 0u;
    $Super$$main(); 
  }
#endif /* __CC_ARM */

/******************************************************************************/
/**
  * @brief  Contains the very first test routines executed right after
  *   the reset
  * @param  : None
  *   Flash interface initialized, Systick timer ON (2ms timebase)
  * @retval : None
  */
void STL_StartUp(void)
{
  uint32_t crc_result;
  uint32_t index;
  ClockStatus clk_sts;

  /* block run time tests performed at SysTick interrupt */
  TickCounter= TickCounterInv= 0;
  
  /* Reset of all peripherals, Initializes the Flash interface and the Systick */
  HAL_Init();

  #ifdef STL_VERBOSE_POR
    /* Update the SystemCoreClock global variable as USART Baud rate setting depends on it */
    SystemCoreClockUpdate();
    USART_Configuration();
    printf("\n\n\r *******  Self Test Library Init  *******\n\r");
  #endif

  #if defined STL_EVAL_MODE
    /* init LEDs on evaluation board  to indicate phases of startup */
    BSP_LED_Init(LED_VLM);
    BSP_LED_Init(LED_NVM);
    BSP_LED_Init(LED_ERR);
  #endif
    
  #if defined STL_USER_AUX_MODE
    User_AUX_Init(AUX_VLM);
    User_AUX_Init(AUX_NVM);
  #endif /* STL_USER_AUX_MODE */
  
  /*--------------------------------------------------------------------------*/
  /*------------------- CPU registers and flags self test --------------------*/
  /*--------------------------------------------------------------------------*/

  /* Initialization of counters for control flow monitoring */
  init_control_flow();

  control_flow_call(CPU_TEST_CALLER);
  /* WARNING: all registers destroyed when exiting this function (including
  preserved registers R4 to R11) while excluding stack pointer R13) */
  if (STL_StartUpCPUTest() != CPUTEST_SUCCESS)
  {
    #ifdef STL_VERBOSE_POR
      printf("Start-up CPU Test Failure\n\r");
    #endif /* STL_VERBOSE_POR */
    
    FailSafePOR();
  }
  else  /* CPU Test OK */
  {
    control_flow_resume(CPU_TEST_CALLER);
    
    #ifdef STL_VERBOSE_POR
      printf(" Start-up CPU Test OK\n\r");
    #endif /* STL_VERBOSE_POR */
  }


  /*--------------------------------------------------------------------------*/
  /*--------------------- WDOGs functionality self test ----------------------*/
  /*--------------------------------------------------------------------------*/

  control_flow_call(WDG_TEST_CALLER);

  /* two phases IWDG & WWDG test, system reset is performed here */
  STL_WDGSelfTest();
  
  control_flow_resume(WDG_TEST_CALLER);
  
  /*--------------------------------------------------------------------------*/
  /*--------------------- Switch ON PLL for maximum speed --------------------*/
  /*--------------------------------------------------------------------------*/
  #ifdef STL_VERBOSE_POR
    /* finish communication flow prior system clock change */
    while (HAL_UART_GetState(&UartHandle) == HAL_UART_STATE_BUSY_TX)
    { }
  #endif /* STL_VERBOSE_POR */
  
  /* No Control flow check here (not safety critical) */
  /* Switch on the PLL to speed-up Flash and RAM tests */
  StartUpClock_Config();

  #ifdef STL_VERBOSE_POR
    /* Re-init communication channel with modified clock setting */
    SystemCoreClockUpdate();
    USART_Reconfiguration();
  #endif /* STL_VERBOSE_POR */
  
  /*--------------------------------------------------------------------------*/
  /*--------------------- Invariable memory CRC check ------------------------*/
  /*--------------------------------------------------------------------------*/
  
  #ifdef STL_EVAL_MODE
    /* init LED pins in push pull slow output mode */
    BSP_LED_Init(LED_VLM);
    BSP_LED_Init(LED_NVM);
    BSP_LED_Init(LED_ERR);
    
    /* LED_NVM On for debug purposes */
    BSP_LED_On(LED_NVM);
  #endif /* STL_EVAL_MODE */
    
  #if defined STL_USER_AUX_MODE
    User_AUX_Init(AUX_VLM);
    User_AUX_Init(AUX_NVM);
    
