erikjuvan/stm32_cmake_examples/ex1_wm_pu_safe/src/STL/X_CUBE_CLASSB_V2_3_0/src/stm32xx_STLstartup.c
    User_AUX_On(AUX_NVM);
  #endif /* STL_USER_AUX_MODE */

  control_flow_call(CRC32_TEST_CALLER);
  /* Compute the 32-bit crc of the whole Flash by CRC unit except the checksum
     pattern stored at top of FLASH */
  
  __CRC_CLK_ENABLE();
  
  CrcHandle.Instance = CRC;
  CrcHandle.State = HAL_CRC_STATE_RESET;
  #ifdef  CRC_UNIT_CONFIGURABLE
    CrcHandle.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
    CrcHandle.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
    CrcHandle.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_NONE;
    CrcHandle.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLED;
    CrcHandle.InputDataFormat              = CRC_INPUTDATA_FORMAT_WORDS;
  #endif
  HAL_CRC_Init(&CrcHandle);
  
  #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
    /* ==============================================================================*/
    /* MISRA violation of rule 11.4, 17.4 - pointer arithmetic is used for
       CRC calculation */
    #pragma diag_suppress=Pm088,Pm141
  #endif  /* __IAR_SYSTEMS_ICC__ */

    /* the next for cycle replaces the standard HAL function call
       crc_result = HAL_CRC_Calculate(&CrcHandle, (uint32_t *)ROM_START, (uint32_t)ROM_SIZEinWORDS); 
       due to bug at IAR linker - check sum computation can't support both big & little endian  */
     
    for(index = 0; index < (uint32_t)ROM_SIZEinWORDS; index++)
    {
      CRC->DR = __REV(*((uint32_t *)ROM_START + index));
    }
    crc_result = CRC->DR;

  #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
    #pragma diag_default=Pm088,Pm141
    /* ==============================================================================*/
  #endif  /* __IAR_SYSTEMS_ICC__ */
          
  control_flow_resume(CRC32_TEST_CALLER);

  /* Store pattern for regular 32-bit crc computation */
  control_flow_call(CRC_TEST_CALLER);
  /* ==============================================================================*/
  /* MISRA violation of rule 10.1, 11.3 and 11.4: integral casting and pointer arithmetic 
     is used here to manage the crc computation and Check Class B var integrity */
  
  #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
    #pragma diag_suppress=Pm129,Pm140,Pm141

    if(crc_result != REF_CRC32)

    #pragma diag_default=Pm129,Pm140,Pm141
  #endif  /* __IAR_SYSTEMS_ICC__ */
  /* ==============================================================================*/
      
  #if defined(__CC_ARM) || defined(__GNUC__)             /* KEIL or GCC Compiler */
    /* Computed 32-bit crc check is temporary stored at crc_result. This value must be copied
       into __Check_Sum address placed at the end of Flash area (see file startup_stm32xx.s)
       Condition here can be reversed for debugging */

    if(crc_result != *(uint32_t *)(&REF_CRC32))
  #endif  /* __CC_ARM */   
    {
      #ifdef STL_VERBOSE_POR
        printf("FLASH 32-bit CRC Error at Start-up\n\r");
      #endif  /* STL_VERBOSE_POR */
      FailSafePOR();
    }
    else
    { /* Test OK */
      #ifdef STL_VERBOSE_POR
        printf(" Start-up FLASH 32-bit CRC OK\n\r");
      #endif  /* STL_VERBOSE_POR */

      /* If else statement is not executed, it will be detected by control flow monitoring */
      control_flow_resume(CRC_TEST_CALLER);  
    }
    
  HAL_CRC_DeInit(&CrcHandle);
  #ifdef STL_EVAL_MODE
    /* LED_NVM Off for debug purposes */
    BSP_LED_Off(LED_NVM);
  #endif /* STL_EVAL_MODE */
    
  #if defined STL_USER_AUX_MODE
    User_AUX_Off(AUX_NVM);
  #endif /* STL_USER_AUX_MODE */

  /*--------------------------------------------------------------------------*/
  /*   Verify Control flow before RAM init (which clears Ctrl flow counters)  */
  /*--------------------------------------------------------------------------*/
  if (control_flow_check_point(CHECKPOINT1) == ERROR)
  {
     #ifdef STL_VERBOSE_POR
       printf("Control Flow Error Checkpoint 1\n\r");
     #endif  /* STL_VERBOSE_POR */
     FailSafePOR();
  }
  else
  {
   #ifdef STL_VERBOSE_POR
    printf(" Control Flow Checkpoint 1 OK\n\r");
   #endif  /* STL_VERBOSE_POR */
  }
  
  /*--------------------------------------------------------------------------*/
  /* --------------------- Variable memory functional test -------------------*/
  /*--------------------------------------------------------------------------*/
  #ifdef STL_EVAL_MODE
    /* LED_VLM On for debug purposes */
    BSP_LED_On(LED_VLM);
  #endif /* STL_EVAL_MODE */
  
  #if defined STL_USER_AUX_MODE
    User_AUX_On(AUX_VLM);
  #endif /* STL_USER_AUX_MODE */
    
  /* no stack operation can be performed during the test */  
  __disable_irq();
  
  /* WARNING: The stack is initialized into background pattern when exiting from this routine */
  if (STL_FullRamMarchC(RAM_START, RAM_END, BCKGRND, RAM_BCKUP) != SRAMTEST_SUCCESS)
  {
    #ifdef STL_VERBOSE_POR
      #ifdef __GNUC__
      /* restore the data segment initializers from flash to SRAM (repeat  procedure from startup) */
        Startup_Copy_Handler();
      #endif /* GCC Compiler */
        
      #ifdef __IAR_SYSTEMS_ICC__
        __iar_data_init3();
      #endif /* __IAR_SYSTEMS_ICC__ */
        
      /* restore interrupt capability */
      __enable_irq();
      /* restore destroyed content of HAL structure for UART */
      SystemCoreClockUpdate();
      USART_Reconfiguration();
      printf("\rRAM Test Failure\n\r");
    #endif  /* STL_VERBOSE_POR */
    FailSafePOR();
  }

  #ifdef STL_VERBOSE_POR
    #ifdef __GNUC__
    /* restore the data segment initializers from flash to SRAM (repeat  procedure from startup) */
      Startup_Copy_Handler();
    #endif /* GCC Compiler */
        
    #ifdef __IAR_SYSTEMS_ICC__
      __iar_data_init3();
    #endif /* __IAR_SYSTEMS_ICC__ */
        
    /* restore destroyed content of HAL structure for UART */
    SystemCoreClockUpdate();
    USART_Reconfiguration();
    printf("\r Full RAM Test OK\n\r");
  #endif /* STL_VERBOSE_POR */

  /* restore interrupt capability */
  __enable_irq();
  

  /* Initialization of counters for control flow monitoring 
     (destroyed during RAM test) */
  init_control_flow();
  
  #ifdef STL_EVAL_MODE
    /* restore destroyed C compiler constant areas */
    #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
      __iar_data_init3();
      /* LED_VLM Off for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_Off(LED_VLM);
    #endif /* __IAR_SYSTEMS_ICC__ */
    #ifdef __GNUC__  /* GCC Compiler */
      Startup_Copy_Handler();
      /* LED_VLM Off for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_Off(LED_VLM);
    #endif /* __GNUC__ */
  #endif /* STL_EVAL_MODE */

  #if defined STL_USER_AUX_MODE
    User_AUX_Off(AUX_VLM);
  #endif /* STL_USER_AUX_MODE */

  /*--------------------------------------------------------------------------*/
  /*------------- Store reference 32-bit CRC in RAM after RAM test -----------*/
  /*--------------------------------------------------------------------------*/
  control_flow_call(CRC_STORE_CALLER);
  
  /* restore destroyed content of HAL structure for CRC */
  CrcHandle.Instance = CRC;
  CrcHandle.State= HAL_CRC_STATE_READY;
  #ifdef  CRC_UNIT_CONFIGURABLE
    CrcHandle.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
    CrcHandle.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
    CrcHandle.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_NONE;
    CrcHandle.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLED;
    CrcHandle.InputDataFormat = CRC_INPUTDATA_FORMAT_WORDS;
  #endif
  
  /* read and store content of CRC calculation result */
  RefCrc32 = HAL_CRC_Accumulate(&CrcHandle, 0u, 0u);  
  RefCrc32Inv = ~RefCrc32;
  
  control_flow_resume(CRC_STORE_CALLER);  

  /*--------------------------------------------------------------------------*/
  /*----------------------- Clock Frequency Self Test ------------------------*/
  /*--------------------------------------------------------------------------*/
  #ifdef STL_EVAL_MODE
    #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
      /* LED_NVM On for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_On(LED_NVM);
    #endif /* __IAR_SYSTEMS_ICC__ */
    #ifdef __GNUC__  /* GCC Compiler */
      /* LED_VLM On for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_On(LED_NVM);
    #endif /* __GNUC__ */
  #endif /* STL_EVAL_MODE */
      
  #if defined STL_USER_AUX_MODE
    User_AUX_On(AUX_NVM);
  #endif /* STL_USER_AUX_MODE */
    
  #ifdef STL_VERBOSE_POR
    /* finish communication flow prior system clock change */
    while (HAL_UART_GetState(&UartHandle) == HAL_UART_STATE_BUSY_TX)
    { }
  #endif /* STL_VERBOSE_POR */
  
  control_flow_call(CLOCK_TEST_CALLER);

